ERP.belugaerp/src/InformationRegisters/бг_creatio_ВыгруженныеПакеты/бг_creatio_ВыгруженныеПакеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>бг_creatio_ВыгруженныеПакеты</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Отправлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Принят</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерЗаписиВПакете</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP.belugaerp/src/InformationRegisters/бг_creatio_ВыгруженныеПакеты/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

// Записывает информацию в регистр о выгруженном пакете
//
// Параметры:
//  ИдентификаторПакета - Строка;
//  НомерЗаписиВПакете - Число;
//  Период - Дата;
//  Отправлен - Булево;
//  Принят - Булево;
//
// Тип возвращаемого значения - Структура
//
Функция ЗарегистрироватьВыгрузкуПакета(ИдентификаторПакета, НомерЗаписиВПакете, Период, Отправлен, Принят) Экспорт
	
	Результат = Новый Структура("ЕстьОшибки, ОписаниеОшибки", Ложь, "");
	
	МенеджерЗаписиДанных = РегистрыСведений.бг_creatio_ВыгруженныеПакеты.СоздатьМенеджерЗаписи();
	МенеджерЗаписиДанных.Период = ?(Период = Неопределено, ТекущаяДатаСеанса(), Период);
	МенеджерЗаписиДанных.Отправлен = Отправлен;
	МенеджерЗаписиДанных.Принят = Принят;
	МенеджерЗаписиДанных.ИдентификаторПакета = ИдентификаторПакета;
	МенеджерЗаписиДанных.НомерЗаписиВПакете = НомерЗаписиВПакете;
		
	Попытка
		МенеджерЗаписиДанных.Записать();
	Исключение
		Результат.ЕстьОшибки = Истина;
		Результат.ОписаниеОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
